# GetFaceReferences Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..GetFaceReferences Method
MassSurfaceData Class See Also
---
Gets References to the faces that the MassSurfaceData provides properties for.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<Reference> GetFaceReferences()
```

Visual Basic
---
```text
Public Function GetFaceReferences As IList(Of Reference)
```

Visual C++
---
```text
public:
IList<Reference^>^ GetFaceReferences()
```

# ### Return Value
Returns an array of References to Faces that the MassSurfaceData provides properties for.
# Remarks
The results are always references to Faces. The Reference Type should be REFERENCE_TYPE_SURFACE. Currently Revit improperly reports it as REFERENCE_TYPE_NONE.
# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace